Date and time: 2019-01-17 16-37-45

Datasets used: ['/home/nvidia/Desktop/lanes-segmentation/data/images/innopolis']

633
633
Image dtype:uint8
Label dtype:uint8

633
633
0
0
Class weights: [0.16541089 1.         1.42351978]

tf.estimator package not installed.
tf.estimator package not installed.
Model summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 640, 3)  0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 256, 640, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
Conv (Conv2D)                   (None, 128, 320, 32) 864         lambda_1[0][0]                   
__________________________________________________________________________________________________
Conv_BN (BatchNormalization)    (None, 128, 320, 32) 128         Conv[0][0]                       
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 128, 320, 32) 0           Conv_BN[0][0]                    
__________________________________________________________________________________________________
expanded_conv_depthwise (Depthw (None, 128, 320, 32) 288         lambda_2[0][0]                   
__________________________________________________________________________________________________
expanded_conv_depthwise_BN (Bat (None, 128, 320, 32) 128         expanded_conv_depthwise[0][0]    
__________________________________________________________________________________________________
expanded_conv_depthwise_relu (L (None, 128, 320, 32) 0           expanded_conv_depthwise_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_project (Conv2D)  (None, 128, 320, 16) 512         expanded_conv_depthwise_relu[0][0
__________________________________________________________________________________________________
expanded_conv_project_BN (Batch (None, 128, 320, 16) 64          expanded_conv_project[0][0]      
__________________________________________________________________________________________________
expanded_conv_1_expand (Conv2D) (None, 128, 320, 96) 1536        expanded_conv_project_BN[0][0]   
__________________________________________________________________________________________________
expanded_conv_1_expand_BN (Batc (None, 128, 320, 96) 384         expanded_conv_1_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_1_expand_relu (La (None, 128, 320, 96) 0           expanded_conv_1_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_1_depthwise (Dept (None, 64, 160, 96)  864         expanded_conv_1_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_1_depthwise_BN (B (None, 64, 160, 96)  384         expanded_conv_1_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_1_depthwise_relu  (None, 64, 160, 96)  0           expanded_conv_1_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_1_project (Conv2D (None, 64, 160, 24)  2304        expanded_conv_1_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_1_project_BN (Bat (None, 64, 160, 24)  96          expanded_conv_1_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_2_expand (Conv2D) (None, 64, 160, 144) 3456        expanded_conv_1_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_2_expand_BN (Batc (None, 64, 160, 144) 576         expanded_conv_2_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_2_expand_relu (La (None, 64, 160, 144) 0           expanded_conv_2_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_2_depthwise (Dept (None, 64, 160, 144) 1296        expanded_conv_2_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_2_depthwise_BN (B (None, 64, 160, 144) 576         expanded_conv_2_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_2_depthwise_relu  (None, 64, 160, 144) 0           expanded_conv_2_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_2_project (Conv2D (None, 64, 160, 24)  3456        expanded_conv_2_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_2_project_BN (Bat (None, 64, 160, 24)  96          expanded_conv_2_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_2_add (Add)       (None, 64, 160, 24)  0           expanded_conv_1_project_BN[0][0] 
                                                                 expanded_conv_2_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_3_expand (Conv2D) (None, 64, 160, 144) 3456        expanded_conv_2_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_3_expand_BN (Batc (None, 64, 160, 144) 576         expanded_conv_3_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_3_expand_relu (La (None, 64, 160, 144) 0           expanded_conv_3_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_3_depthwise (Dept (None, 32, 80, 144)  1296        expanded_conv_3_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_3_depthwise_BN (B (None, 32, 80, 144)  576         expanded_conv_3_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_3_depthwise_relu  (None, 32, 80, 144)  0           expanded_conv_3_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_3_project (Conv2D (None, 32, 80, 32)   4608        expanded_conv_3_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_3_project_BN (Bat (None, 32, 80, 32)   128         expanded_conv_3_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_4_expand (Conv2D) (None, 32, 80, 192)  6144        expanded_conv_3_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_4_expand_BN (Batc (None, 32, 80, 192)  768         expanded_conv_4_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_4_expand_relu (La (None, 32, 80, 192)  0           expanded_conv_4_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_4_depthwise (Dept (None, 32, 80, 192)  1728        expanded_conv_4_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_4_depthwise_BN (B (None, 32, 80, 192)  768         expanded_conv_4_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_4_depthwise_relu  (None, 32, 80, 192)  0           expanded_conv_4_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_4_project (Conv2D (None, 32, 80, 32)   6144        expanded_conv_4_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_4_project_BN (Bat (None, 32, 80, 32)   128         expanded_conv_4_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_4_add (Add)       (None, 32, 80, 32)   0           expanded_conv_3_project_BN[0][0] 
                                                                 expanded_conv_4_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_5_expand (Conv2D) (None, 32, 80, 192)  6144        expanded_conv_4_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_5_expand_BN (Batc (None, 32, 80, 192)  768         expanded_conv_5_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_5_expand_relu (La (None, 32, 80, 192)  0           expanded_conv_5_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_5_depthwise (Dept (None, 32, 80, 192)  1728        expanded_conv_5_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_5_depthwise_BN (B (None, 32, 80, 192)  768         expanded_conv_5_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_5_depthwise_relu  (None, 32, 80, 192)  0           expanded_conv_5_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_5_project (Conv2D (None, 32, 80, 32)   6144        expanded_conv_5_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_5_project_BN (Bat (None, 32, 80, 32)   128         expanded_conv_5_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_5_add (Add)       (None, 32, 80, 32)   0           expanded_conv_4_add[0][0]        
                                                                 expanded_conv_5_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_6_expand (Conv2D) (None, 32, 80, 192)  6144        expanded_conv_5_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_6_expand_BN (Batc (None, 32, 80, 192)  768         expanded_conv_6_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_6_expand_relu (La (None, 32, 80, 192)  0           expanded_conv_6_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_6_depthwise (Dept (None, 32, 80, 192)  1728        expanded_conv_6_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_6_depthwise_BN (B (None, 32, 80, 192)  768         expanded_conv_6_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_6_depthwise_relu  (None, 32, 80, 192)  0           expanded_conv_6_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_6_project (Conv2D (None, 32, 80, 64)   12288       expanded_conv_6_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_6_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_6_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_7_expand (Conv2D) (None, 32, 80, 384)  24576       expanded_conv_6_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_7_expand_BN (Batc (None, 32, 80, 384)  1536        expanded_conv_7_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_7_expand_relu (La (None, 32, 80, 384)  0           expanded_conv_7_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_7_depthwise (Dept (None, 32, 80, 384)  3456        expanded_conv_7_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_7_depthwise_BN (B (None, 32, 80, 384)  1536        expanded_conv_7_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_7_depthwise_relu  (None, 32, 80, 384)  0           expanded_conv_7_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_7_project (Conv2D (None, 32, 80, 64)   24576       expanded_conv_7_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_7_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_7_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_7_add (Add)       (None, 32, 80, 64)   0           expanded_conv_6_project_BN[0][0] 
                                                                 expanded_conv_7_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_8_expand (Conv2D) (None, 32, 80, 384)  24576       expanded_conv_7_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_8_expand_BN (Batc (None, 32, 80, 384)  1536        expanded_conv_8_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_8_expand_relu (La (None, 32, 80, 384)  0           expanded_conv_8_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_8_depthwise (Dept (None, 32, 80, 384)  3456        expanded_conv_8_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_8_depthwise_BN (B (None, 32, 80, 384)  1536        expanded_conv_8_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_8_depthwise_relu  (None, 32, 80, 384)  0           expanded_conv_8_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_8_project (Conv2D (None, 32, 80, 64)   24576       expanded_conv_8_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_8_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_8_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_8_add (Add)       (None, 32, 80, 64)   0           expanded_conv_7_add[0][0]        
                                                                 expanded_conv_8_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_9_expand (Conv2D) (None, 32, 80, 384)  24576       expanded_conv_8_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_9_expand_BN (Batc (None, 32, 80, 384)  1536        expanded_conv_9_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_9_expand_relu (La (None, 32, 80, 384)  0           expanded_conv_9_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_9_depthwise (Dept (None, 32, 80, 384)  3456        expanded_conv_9_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_9_depthwise_BN (B (None, 32, 80, 384)  1536        expanded_conv_9_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_9_depthwise_relu  (None, 32, 80, 384)  0           expanded_conv_9_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_9_project (Conv2D (None, 32, 80, 64)   24576       expanded_conv_9_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_9_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_9_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_9_add (Add)       (None, 32, 80, 64)   0           expanded_conv_8_add[0][0]        
                                                                 expanded_conv_9_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_10_expand (Conv2D (None, 32, 80, 384)  24576       expanded_conv_9_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_10_expand_BN (Bat (None, 32, 80, 384)  1536        expanded_conv_10_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_10_expand_relu (L (None, 32, 80, 384)  0           expanded_conv_10_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_10_depthwise (Dep (None, 32, 80, 384)  3456        expanded_conv_10_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_10_depthwise_BN ( (None, 32, 80, 384)  1536        expanded_conv_10_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_10_depthwise_relu (None, 32, 80, 384)  0           expanded_conv_10_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_10_project (Conv2 (None, 32, 80, 96)   36864       expanded_conv_10_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_10_project_BN (Ba (None, 32, 80, 96)   384         expanded_conv_10_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_11_expand (Conv2D (None, 32, 80, 576)  55296       expanded_conv_10_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_11_expand_BN (Bat (None, 32, 80, 576)  2304        expanded_conv_11_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_11_expand_relu (L (None, 32, 80, 576)  0           expanded_conv_11_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_11_depthwise (Dep (None, 32, 80, 576)  5184        expanded_conv_11_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_11_depthwise_BN ( (None, 32, 80, 576)  2304        expanded_conv_11_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_11_depthwise_relu (None, 32, 80, 576)  0           expanded_conv_11_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_11_project (Conv2 (None, 32, 80, 96)   55296       expanded_conv_11_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_11_project_BN (Ba (None, 32, 80, 96)   384         expanded_conv_11_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_11_add (Add)      (None, 32, 80, 96)   0           expanded_conv_10_project_BN[0][0]
                                                                 expanded_conv_11_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_12_expand (Conv2D (None, 32, 80, 576)  55296       expanded_conv_11_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_12_expand_BN (Bat (None, 32, 80, 576)  2304        expanded_conv_12_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_12_expand_relu (L (None, 32, 80, 576)  0           expanded_conv_12_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_12_depthwise (Dep (None, 32, 80, 576)  5184        expanded_conv_12_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_12_depthwise_BN ( (None, 32, 80, 576)  2304        expanded_conv_12_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_12_depthwise_relu (None, 32, 80, 576)  0           expanded_conv_12_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_12_project (Conv2 (None, 32, 80, 96)   55296       expanded_conv_12_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_12_project_BN (Ba (None, 32, 80, 96)   384         expanded_conv_12_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_12_add (Add)      (None, 32, 80, 96)   0           expanded_conv_11_add[0][0]       
                                                                 expanded_conv_12_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_13_expand (Conv2D (None, 32, 80, 576)  55296       expanded_conv_12_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_13_expand_BN (Bat (None, 32, 80, 576)  2304        expanded_conv_13_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_13_expand_relu (L (None, 32, 80, 576)  0           expanded_conv_13_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_13_depthwise (Dep (None, 32, 80, 576)  5184        expanded_conv_13_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_13_depthwise_BN ( (None, 32, 80, 576)  2304        expanded_conv_13_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_13_depthwise_relu (None, 32, 80, 576)  0           expanded_conv_13_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_13_project (Conv2 (None, 32, 80, 160)  92160       expanded_conv_13_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_13_project_BN (Ba (None, 32, 80, 160)  640         expanded_conv_13_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_14_expand (Conv2D (None, 32, 80, 960)  153600      expanded_conv_13_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_14_expand_BN (Bat (None, 32, 80, 960)  3840        expanded_conv_14_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_14_expand_relu (L (None, 32, 80, 960)  0           expanded_conv_14_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_14_depthwise (Dep (None, 32, 80, 960)  8640        expanded_conv_14_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_14_depthwise_BN ( (None, 32, 80, 960)  3840        expanded_conv_14_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_14_depthwise_relu (None, 32, 80, 960)  0           expanded_conv_14_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_14_project (Conv2 (None, 32, 80, 160)  153600      expanded_conv_14_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_14_project_BN (Ba (None, 32, 80, 160)  640         expanded_conv_14_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_14_add (Add)      (None, 32, 80, 160)  0           expanded_conv_13_project_BN[0][0]
                                                                 expanded_conv_14_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_15_expand (Conv2D (None, 32, 80, 960)  153600      expanded_conv_14_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_15_expand_BN (Bat (None, 32, 80, 960)  3840        expanded_conv_15_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_15_expand_relu (L (None, 32, 80, 960)  0           expanded_conv_15_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_15_depthwise (Dep (None, 32, 80, 960)  8640        expanded_conv_15_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_15_depthwise_BN ( (None, 32, 80, 960)  3840        expanded_conv_15_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_15_depthwise_relu (None, 32, 80, 960)  0           expanded_conv_15_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_15_project (Conv2 (None, 32, 80, 160)  153600      expanded_conv_15_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_15_project_BN (Ba (None, 32, 80, 160)  640         expanded_conv_15_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_15_add (Add)      (None, 32, 80, 160)  0           expanded_conv_14_add[0][0]       
                                                                 expanded_conv_15_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_16_expand (Conv2D (None, 32, 80, 960)  153600      expanded_conv_15_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_16_expand_BN (Bat (None, 32, 80, 960)  3840        expanded_conv_16_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_16_expand_relu (L (None, 32, 80, 960)  0           expanded_conv_16_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_16_depthwise (Dep (None, 32, 80, 960)  8640        expanded_conv_16_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_16_depthwise_BN ( (None, 32, 80, 960)  3840        expanded_conv_16_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_16_depthwise_relu (None, 32, 80, 960)  0           expanded_conv_16_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_16_project (Conv2 (None, 32, 80, 320)  307200      expanded_conv_16_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_16_project_BN (Ba (None, 32, 80, 320)  1280        expanded_conv_16_project[0][0]   
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 320)    0           expanded_conv_16_project_BN[0][0]
__________________________________________________________________________________________________
image_pooling (Conv2D)          (None, 1, 1, 256)    81920       average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
image_pooling_BN (BatchNormaliz (None, 1, 1, 256)    1024        image_pooling[0][0]              
__________________________________________________________________________________________________
aspp0 (Conv2D)                  (None, 32, 80, 256)  81920       expanded_conv_16_project_BN[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1, 1, 256)    0           image_pooling_BN[0][0]           
__________________________________________________________________________________________________
aspp0_BN (BatchNormalization)   (None, 32, 80, 256)  1024        aspp0[0][0]                      
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 32, 80, 256)  0           activation_1[0][0]               
__________________________________________________________________________________________________
aspp0_activation (Activation)   (None, 32, 80, 256)  0           aspp0_BN[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 80, 512)  0           lambda_3[0][0]                   
                                                                 aspp0_activation[0][0]           
__________________________________________________________________________________________________
concat_projection (Conv2D)      (None, 32, 80, 256)  131072      concatenate_1[0][0]              
__________________________________________________________________________________________________
concat_projection_BN (BatchNorm (None, 32, 80, 256)  1024        concat_projection[0][0]          
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 80, 256)  0           concat_projection_BN[0][0]       
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 80, 256)  0           activation_2[0][0]               
__________________________________________________________________________________________________
subpixel_1 (Subpixel)           (None, 256, 640, 3)  49344       dropout_1[0][0]                  
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 163840, 3)    0           subpixel_1[0][0]                 
__________________________________________________________________________________________________
pred_mask (Activation)          (None, 163840, 3)    0           reshape_2[0][0]                  
==================================================================================================
Total params: 2,190,592
Trainable params: 49,344
Non-trainable params: 2,141,248
__________________________________________________________________________________________________
Optimizer: <keras.optimizers.Adam object at 0x7f9b7e87b8>, learning rate: 0.0007, loss: ['categorical_crossentropy'], metrics: ['accuracy']

Callbacks: [<keras.callbacks.ModelCheckpoint object at 0x7f104c7e10>, <keras.callbacks.ReduceLROnPlateau object at 0x7f105c2ef0>, <keras.callbacks.EarlyStopping object at 0x7f104dd7b8>, <keras.callbacks.CSVLogger object at 0x7f104dd780>]

Steps per epoch: 633
Validation steps: 0

Starting training...

Epoch 1/1000
 - 53s - loss: 0.4140 - acc: 0.8275

Epoch 00001: loss improved from inf to 0.41401, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 2/1000
 - 39s - loss: 0.3368 - acc: 0.8578

Epoch 00002: loss improved from 0.41401 to 0.33681, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 3/1000
 - 39s - loss: 0.3262 - acc: 0.8624

Epoch 00003: loss improved from 0.33681 to 0.32623, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 4/1000
 - 40s - loss: 0.3203 - acc: 0.8650

Epoch 00004: loss improved from 0.32623 to 0.32032, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 5/1000
 - 39s - loss: 0.3169 - acc: 0.8667

Epoch 00005: loss improved from 0.32032 to 0.31692, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 6/1000
 - 39s - loss: 0.3147 - acc: 0.8677

Epoch 00006: loss improved from 0.31692 to 0.31474, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 7/1000
 - 39s - loss: 0.3130 - acc: 0.8682

Epoch 00007: loss improved from 0.31474 to 0.31302, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 8/1000
 - 39s - loss: 0.3118 - acc: 0.8690

Epoch 00008: loss improved from 0.31302 to 0.31180, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 9/1000
 - 39s - loss: 0.3110 - acc: 0.8692

Epoch 00009: loss improved from 0.31180 to 0.31100, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 10/1000
 - 39s - loss: 0.3105 - acc: 0.8694

Epoch 00010: loss improved from 0.31100 to 0.31051, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 11/1000
 - 39s - loss: 0.3099 - acc: 0.8697

Epoch 00011: loss improved from 0.31051 to 0.30994, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 12/1000
 - 39s - loss: 0.3096 - acc: 0.8699

Epoch 00012: loss improved from 0.30994 to 0.30956, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 13/1000
 - 39s - loss: 0.3093 - acc: 0.8701

Epoch 00013: loss improved from 0.30956 to 0.30930, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 14/1000
 - 39s - loss: 0.3090 - acc: 0.8702

Epoch 00014: loss improved from 0.30930 to 0.30900, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 15/1000
 - 39s - loss: 0.3090 - acc: 0.8701

Epoch 00015: loss improved from 0.30900 to 0.30898, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 16/1000
 - 39s - loss: 0.3089 - acc: 0.8704

Epoch 00016: loss improved from 0.30898 to 0.30891, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 17/1000
 - 39s - loss: 0.3087 - acc: 0.8704

Epoch 00017: loss improved from 0.30891 to 0.30869, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 18/1000
 - 39s - loss: 0.3088 - acc: 0.8704

Epoch 00018: loss did not improve from 0.30869
Epoch 19/1000
 - 39s - loss: 0.3087 - acc: 0.8705

Epoch 00019: loss improved from 0.30869 to 0.30866, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 20/1000
 - 39s - loss: 0.3085 - acc: 0.8705

Epoch 00020: loss improved from 0.30866 to 0.30852, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 21/1000
 - 39s - loss: 0.3085 - acc: 0.8704

Epoch 00021: loss did not improve from 0.30852
Epoch 22/1000
 - 39s - loss: 0.3085 - acc: 0.8705

Epoch 00022: loss improved from 0.30852 to 0.30846, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 23/1000
 - 39s - loss: 0.3085 - acc: 0.8704

Epoch 00023: loss did not improve from 0.30846
Epoch 24/1000
 - 39s - loss: 0.3082 - acc: 0.8705

Epoch 00024: loss improved from 0.30846 to 0.30825, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 25/1000
 - 39s - loss: 0.3085 - acc: 0.8703

Epoch 00025: loss did not improve from 0.30825
Epoch 26/1000
 - 39s - loss: 0.3084 - acc: 0.8706

Epoch 00026: loss did not improve from 0.30825
Epoch 27/1000
 - 39s - loss: 0.3083 - acc: 0.8705

Epoch 00027: loss did not improve from 0.30825
Epoch 28/1000
 - 39s - loss: 0.3084 - acc: 0.8706

Epoch 00028: loss did not improve from 0.30825

Epoch 00028: ReduceLROnPlateau reducing learning rate to 0.0003499999875202775.
Epoch 29/1000
 - 39s - loss: 0.3058 - acc: 0.8718

Epoch 00029: loss improved from 0.30825 to 0.30584, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 30/1000
 - 39s - loss: 0.3057 - acc: 0.8720

Epoch 00030: loss improved from 0.30584 to 0.30568, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 31/1000
 - 39s - loss: 0.3055 - acc: 0.8720

Epoch 00031: loss improved from 0.30568 to 0.30554, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 32/1000
 - 39s - loss: 0.3056 - acc: 0.8719

Epoch 00032: loss did not improve from 0.30554
Epoch 33/1000
 - 39s - loss: 0.3057 - acc: 0.8719

Epoch 00033: loss did not improve from 0.30554
Epoch 34/1000
 - 39s - loss: 0.3054 - acc: 0.8721

Epoch 00034: loss improved from 0.30554 to 0.30538, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 35/1000
 - 39s - loss: 0.3057 - acc: 0.8718

Epoch 00035: loss did not improve from 0.30538
Epoch 36/1000
 - 39s - loss: 0.3057 - acc: 0.8719

Epoch 00036: loss did not improve from 0.30538
Epoch 37/1000
 - 39s - loss: 0.3058 - acc: 0.8719

Epoch 00037: loss did not improve from 0.30538
Epoch 38/1000
 - 39s - loss: 0.3056 - acc: 0.8720

Epoch 00038: loss did not improve from 0.30538

Epoch 00038: ReduceLROnPlateau reducing learning rate to 0.00017499999376013875.
Epoch 39/1000
 - 39s - loss: 0.3045 - acc: 0.8725

Epoch 00039: loss improved from 0.30538 to 0.30447, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 40/1000
 - 39s - loss: 0.3042 - acc: 0.8726

Epoch 00040: loss improved from 0.30447 to 0.30417, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 41/1000
 - 39s - loss: 0.3042 - acc: 0.8727

Epoch 00041: loss did not improve from 0.30417
Epoch 42/1000
 - 39s - loss: 0.3043 - acc: 0.8726

Epoch 00042: loss did not improve from 0.30417
Epoch 43/1000
 - 39s - loss: 0.3042 - acc: 0.8728

Epoch 00043: loss improved from 0.30417 to 0.30416, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 44/1000
 - 39s - loss: 0.3044 - acc: 0.8725

Epoch 00044: loss did not improve from 0.30416

Epoch 00044: ReduceLROnPlateau reducing learning rate to 8.749999688006938e-05.
Epoch 45/1000
 - 39s - loss: 0.3036 - acc: 0.8730

Epoch 00045: loss improved from 0.30416 to 0.30361, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 46/1000
 - 39s - loss: 0.3035 - acc: 0.8729

Epoch 00046: loss improved from 0.30361 to 0.30349, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 47/1000
 - 39s - loss: 0.3037 - acc: 0.8729

Epoch 00047: loss did not improve from 0.30349
Epoch 48/1000
 - 39s - loss: 0.3036 - acc: 0.8729

Epoch 00048: loss did not improve from 0.30349
Epoch 49/1000
 - 39s - loss: 0.3033 - acc: 0.8731

Epoch 00049: loss improved from 0.30349 to 0.30330, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 50/1000
 - 39s - loss: 0.3033 - acc: 0.8732

Epoch 00050: loss did not improve from 0.30330
Epoch 51/1000
 - 39s - loss: 0.3035 - acc: 0.8730

Epoch 00051: loss did not improve from 0.30330
Epoch 52/1000
 - 39s - loss: 0.3035 - acc: 0.8729

Epoch 00052: loss did not improve from 0.30330
Epoch 53/1000
 - 39s - loss: 0.3035 - acc: 0.8730

Epoch 00053: loss did not improve from 0.30330

Epoch 00053: ReduceLROnPlateau reducing learning rate to 4.374999844003469e-05.
Epoch 54/1000
 - 39s - loss: 0.3033 - acc: 0.8730

Epoch 00054: loss did not improve from 0.30330
Epoch 55/1000
 - 39s - loss: 0.3032 - acc: 0.8733

Epoch 00055: loss improved from 0.30330 to 0.30315, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 56/1000
 - 39s - loss: 0.3031 - acc: 0.8733

Epoch 00056: loss improved from 0.30315 to 0.30311, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 57/1000
 - 39s - loss: 0.3030 - acc: 0.8734

Epoch 00057: loss improved from 0.30311 to 0.30297, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 58/1000
 - 39s - loss: 0.3031 - acc: 0.8732

Epoch 00058: loss did not improve from 0.30297
Epoch 59/1000
 - 39s - loss: 0.3032 - acc: 0.8733

Epoch 00059: loss did not improve from 0.30297
Epoch 60/1000
 - 39s - loss: 0.3032 - acc: 0.8732

Epoch 00060: loss did not improve from 0.30297
Epoch 61/1000
 - 39s - loss: 0.3032 - acc: 0.8732

Epoch 00061: loss did not improve from 0.30297

Epoch 00061: ReduceLROnPlateau reducing learning rate to 2.1874999220017344e-05.
Epoch 62/1000
 - 39s - loss: 0.3028 - acc: 0.8733

Epoch 00062: loss improved from 0.30297 to 0.30281, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 63/1000
 - 39s - loss: 0.3030 - acc: 0.8732

Epoch 00063: loss did not improve from 0.30281
Epoch 64/1000
 - 39s - loss: 0.3028 - acc: 0.8735

Epoch 00064: loss improved from 0.30281 to 0.30279, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 65/1000
 - 39s - loss: 0.3030 - acc: 0.8732

Epoch 00065: loss did not improve from 0.30279
Epoch 66/1000
 - 39s - loss: 0.3028 - acc: 0.8735

Epoch 00066: loss improved from 0.30279 to 0.30279, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5

Epoch 00066: ReduceLROnPlateau reducing learning rate to 1.0937499610008672e-05.
Epoch 67/1000
 - 39s - loss: 0.3029 - acc: 0.8734

Epoch 00067: loss did not improve from 0.30279
Epoch 68/1000
 - 39s - loss: 0.3028 - acc: 0.8734

Epoch 00068: loss improved from 0.30279 to 0.30278, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 69/1000
 - 39s - loss: 0.3028 - acc: 0.8734

Epoch 00069: loss improved from 0.30278 to 0.30276, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 70/1000
 - 39s - loss: 0.3029 - acc: 0.8733

Epoch 00070: loss did not improve from 0.30276

Epoch 00070: ReduceLROnPlateau reducing learning rate to 5.468749805004336e-06.
Epoch 71/1000
 - 39s - loss: 0.3029 - acc: 0.8733

Epoch 00071: loss did not improve from 0.30276
Epoch 72/1000
 - 39s - loss: 0.3028 - acc: 0.8734

Epoch 00072: loss did not improve from 0.30276
Epoch 73/1000
 - 39s - loss: 0.3027 - acc: 0.8736

Epoch 00073: loss improved from 0.30276 to 0.30270, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 74/1000
 - 39s - loss: 0.3031 - acc: 0.8734

Epoch 00074: loss did not improve from 0.30270
Epoch 75/1000
 - 39s - loss: 0.3026 - acc: 0.8735

Epoch 00075: loss improved from 0.30270 to 0.30255, saving model to weights/innopolis/2019-01-17 16-37-45.hdf5
Epoch 76/1000
 - 39s - loss: 0.3027 - acc: 0.8735

Epoch 00076: loss did not improve from 0.30255
Epoch 77/1000
 - 39s - loss: 0.3027 - acc: 0.8733

Epoch 00077: loss did not improve from 0.30255
Epoch 78/1000
 - 39s - loss: 0.3028 - acc: 0.8735

Epoch 00078: loss did not improve from 0.30255
Epoch 79/1000
 - 39s - loss: 0.3029 - acc: 0.8731

Epoch 00079: loss did not improve from 0.30255

Epoch 00079: ReduceLROnPlateau reducing learning rate to 2.734374902502168e-06.
Epoch 80/1000
 - 39s - loss: 0.3029 - acc: 0.8733

Epoch 00080: loss did not improve from 0.30255
Epoch 81/1000
 - 39s - loss: 0.3028 - acc: 0.8733

Epoch 00081: loss did not improve from 0.30255
Epoch 82/1000
 - 39s - loss: 0.3028 - acc: 0.8733

Epoch 00082: loss did not improve from 0.30255
Epoch 83/1000
 - 39s - loss: 0.3027 - acc: 0.8735

Epoch 00083: loss did not improve from 0.30255

Epoch 00083: ReduceLROnPlateau reducing learning rate to 1.367187451251084e-06.
Epoch 84/1000
 - 39s - loss: 0.3027 - acc: 0.8735

Epoch 00084: loss did not improve from 0.30255
Epoch 85/1000
 - 39s - loss: 0.3027 - acc: 0.8735

Epoch 00085: loss did not improve from 0.30255
Epoch 86/1000
 - 39s - loss: 0.3027 - acc: 0.8736

Epoch 00086: loss did not improve from 0.30255
Epoch 87/1000
 - 39s - loss: 0.3027 - acc: 0.8735

Epoch 00087: loss did not improve from 0.30255

Epoch 00087: ReduceLROnPlateau reducing learning rate to 6.83593725625542e-07.
Epoch 88/1000
 - 39s - loss: 0.3026 - acc: 0.8734

Epoch 00088: loss did not improve from 0.30255
Epoch 89/1000
 - 39s - loss: 0.3027 - acc: 0.8734

Epoch 00089: loss did not improve from 0.30255
Epoch 90/1000
 - 39s - loss: 0.3027 - acc: 0.8735

Epoch 00090: loss did not improve from 0.30255
Epoch 91/1000
 - 39s - loss: 0.3026 - acc: 0.8735

Epoch 00091: loss did not improve from 0.30255

Epoch 00091: ReduceLROnPlateau reducing learning rate to 3.41796862812771e-07.
Epoch 92/1000
 - 39s - loss: 0.3027 - acc: 0.8735

Epoch 00092: loss did not improve from 0.30255
Epoch 93/1000
 - 39s - loss: 0.3027 - acc: 0.8733

Epoch 00093: loss did not improve from 0.30255
Epoch 94/1000
 - 39s - loss: 0.3027 - acc: 0.8734

Epoch 00094: loss did not improve from 0.30255
Epoch 95/1000
 - 39s - loss: 0.3027 - acc: 0.8735

Epoch 00095: loss did not improve from 0.30255

Epoch 00095: ReduceLROnPlateau reducing learning rate to 1.708984314063855e-07.
Epoch 00095: early stopping
Finished training

Date and time: 2019-01-17 17-41-13

