Date and time: 2019-01-18 11-56-15

Datasets used: ['/home/kenny/Desktop/lanes-segmentation/data/images/innopolis']

633
633
Image dtype:uint8
Label dtype:uint8

633
633
0
0
Class weights: [0.16541089 1.         1.42351978]

Model summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 640, 3)  0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 256, 640, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
Conv (Conv2D)                   (None, 128, 320, 32) 864         lambda_1[0][0]                   
__________________________________________________________________________________________________
Conv_BN (BatchNormalization)    (None, 128, 320, 32) 128         Conv[0][0]                       
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 128, 320, 32) 0           Conv_BN[0][0]                    
__________________________________________________________________________________________________
expanded_conv_depthwise (Depthw (None, 128, 320, 32) 288         lambda_2[0][0]                   
__________________________________________________________________________________________________
expanded_conv_depthwise_BN (Bat (None, 128, 320, 32) 128         expanded_conv_depthwise[0][0]    
__________________________________________________________________________________________________
expanded_conv_depthwise_relu (L (None, 128, 320, 32) 0           expanded_conv_depthwise_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_project (Conv2D)  (None, 128, 320, 16) 512         expanded_conv_depthwise_relu[0][0
__________________________________________________________________________________________________
expanded_conv_project_BN (Batch (None, 128, 320, 16) 64          expanded_conv_project[0][0]      
__________________________________________________________________________________________________
expanded_conv_1_expand (Conv2D) (None, 128, 320, 96) 1536        expanded_conv_project_BN[0][0]   
__________________________________________________________________________________________________
expanded_conv_1_expand_BN (Batc (None, 128, 320, 96) 384         expanded_conv_1_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_1_expand_relu (La (None, 128, 320, 96) 0           expanded_conv_1_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_1_depthwise (Dept (None, 64, 160, 96)  864         expanded_conv_1_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_1_depthwise_BN (B (None, 64, 160, 96)  384         expanded_conv_1_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_1_depthwise_relu  (None, 64, 160, 96)  0           expanded_conv_1_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_1_project (Conv2D (None, 64, 160, 24)  2304        expanded_conv_1_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_1_project_BN (Bat (None, 64, 160, 24)  96          expanded_conv_1_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_2_expand (Conv2D) (None, 64, 160, 144) 3456        expanded_conv_1_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_2_expand_BN (Batc (None, 64, 160, 144) 576         expanded_conv_2_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_2_expand_relu (La (None, 64, 160, 144) 0           expanded_conv_2_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_2_depthwise (Dept (None, 64, 160, 144) 1296        expanded_conv_2_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_2_depthwise_BN (B (None, 64, 160, 144) 576         expanded_conv_2_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_2_depthwise_relu  (None, 64, 160, 144) 0           expanded_conv_2_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_2_project (Conv2D (None, 64, 160, 24)  3456        expanded_conv_2_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_2_project_BN (Bat (None, 64, 160, 24)  96          expanded_conv_2_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_2_add (Add)       (None, 64, 160, 24)  0           expanded_conv_1_project_BN[0][0] 
                                                                 expanded_conv_2_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_3_expand (Conv2D) (None, 64, 160, 144) 3456        expanded_conv_2_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_3_expand_BN (Batc (None, 64, 160, 144) 576         expanded_conv_3_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_3_expand_relu (La (None, 64, 160, 144) 0           expanded_conv_3_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_3_depthwise (Dept (None, 32, 80, 144)  1296        expanded_conv_3_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_3_depthwise_BN (B (None, 32, 80, 144)  576         expanded_conv_3_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_3_depthwise_relu  (None, 32, 80, 144)  0           expanded_conv_3_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_3_project (Conv2D (None, 32, 80, 32)   4608        expanded_conv_3_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_3_project_BN (Bat (None, 32, 80, 32)   128         expanded_conv_3_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_4_expand (Conv2D) (None, 32, 80, 192)  6144        expanded_conv_3_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_4_expand_BN (Batc (None, 32, 80, 192)  768         expanded_conv_4_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_4_expand_relu (La (None, 32, 80, 192)  0           expanded_conv_4_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_4_depthwise (Dept (None, 32, 80, 192)  1728        expanded_conv_4_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_4_depthwise_BN (B (None, 32, 80, 192)  768         expanded_conv_4_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_4_depthwise_relu  (None, 32, 80, 192)  0           expanded_conv_4_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_4_project (Conv2D (None, 32, 80, 32)   6144        expanded_conv_4_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_4_project_BN (Bat (None, 32, 80, 32)   128         expanded_conv_4_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_4_add (Add)       (None, 32, 80, 32)   0           expanded_conv_3_project_BN[0][0] 
                                                                 expanded_conv_4_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_5_expand (Conv2D) (None, 32, 80, 192)  6144        expanded_conv_4_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_5_expand_BN (Batc (None, 32, 80, 192)  768         expanded_conv_5_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_5_expand_relu (La (None, 32, 80, 192)  0           expanded_conv_5_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_5_depthwise (Dept (None, 32, 80, 192)  1728        expanded_conv_5_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_5_depthwise_BN (B (None, 32, 80, 192)  768         expanded_conv_5_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_5_depthwise_relu  (None, 32, 80, 192)  0           expanded_conv_5_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_5_project (Conv2D (None, 32, 80, 32)   6144        expanded_conv_5_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_5_project_BN (Bat (None, 32, 80, 32)   128         expanded_conv_5_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_5_add (Add)       (None, 32, 80, 32)   0           expanded_conv_4_add[0][0]        
                                                                 expanded_conv_5_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_6_expand (Conv2D) (None, 32, 80, 192)  6144        expanded_conv_5_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_6_expand_BN (Batc (None, 32, 80, 192)  768         expanded_conv_6_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_6_expand_relu (La (None, 32, 80, 192)  0           expanded_conv_6_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_6_depthwise (Dept (None, 32, 80, 192)  1728        expanded_conv_6_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_6_depthwise_BN (B (None, 32, 80, 192)  768         expanded_conv_6_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_6_depthwise_relu  (None, 32, 80, 192)  0           expanded_conv_6_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_6_project (Conv2D (None, 32, 80, 64)   12288       expanded_conv_6_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_6_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_6_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_7_expand (Conv2D) (None, 32, 80, 384)  24576       expanded_conv_6_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_7_expand_BN (Batc (None, 32, 80, 384)  1536        expanded_conv_7_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_7_expand_relu (La (None, 32, 80, 384)  0           expanded_conv_7_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_7_depthwise (Dept (None, 32, 80, 384)  3456        expanded_conv_7_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_7_depthwise_BN (B (None, 32, 80, 384)  1536        expanded_conv_7_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_7_depthwise_relu  (None, 32, 80, 384)  0           expanded_conv_7_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_7_project (Conv2D (None, 32, 80, 64)   24576       expanded_conv_7_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_7_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_7_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_7_add (Add)       (None, 32, 80, 64)   0           expanded_conv_6_project_BN[0][0] 
                                                                 expanded_conv_7_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_8_expand (Conv2D) (None, 32, 80, 384)  24576       expanded_conv_7_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_8_expand_BN (Batc (None, 32, 80, 384)  1536        expanded_conv_8_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_8_expand_relu (La (None, 32, 80, 384)  0           expanded_conv_8_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_8_depthwise (Dept (None, 32, 80, 384)  3456        expanded_conv_8_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_8_depthwise_BN (B (None, 32, 80, 384)  1536        expanded_conv_8_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_8_depthwise_relu  (None, 32, 80, 384)  0           expanded_conv_8_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_8_project (Conv2D (None, 32, 80, 64)   24576       expanded_conv_8_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_8_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_8_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_8_add (Add)       (None, 32, 80, 64)   0           expanded_conv_7_add[0][0]        
                                                                 expanded_conv_8_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_9_expand (Conv2D) (None, 32, 80, 384)  24576       expanded_conv_8_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_9_expand_BN (Batc (None, 32, 80, 384)  1536        expanded_conv_9_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_9_expand_relu (La (None, 32, 80, 384)  0           expanded_conv_9_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_9_depthwise (Dept (None, 32, 80, 384)  3456        expanded_conv_9_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_9_depthwise_BN (B (None, 32, 80, 384)  1536        expanded_conv_9_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_9_depthwise_relu  (None, 32, 80, 384)  0           expanded_conv_9_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_9_project (Conv2D (None, 32, 80, 64)   24576       expanded_conv_9_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_9_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_9_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_9_add (Add)       (None, 32, 80, 64)   0           expanded_conv_8_add[0][0]        
                                                                 expanded_conv_9_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_10_expand (Conv2D (None, 32, 80, 384)  24576       expanded_conv_9_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_10_expand_BN (Bat (None, 32, 80, 384)  1536        expanded_conv_10_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_10_expand_relu (L (None, 32, 80, 384)  0           expanded_conv_10_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_10_depthwise (Dep (None, 32, 80, 384)  3456        expanded_conv_10_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_10_depthwise_BN ( (None, 32, 80, 384)  1536        expanded_conv_10_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_10_depthwise_relu (None, 32, 80, 384)  0           expanded_conv_10_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_10_project (Conv2 (None, 32, 80, 96)   36864       expanded_conv_10_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_10_project_BN (Ba (None, 32, 80, 96)   384         expanded_conv_10_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_11_expand (Conv2D (None, 32, 80, 576)  55296       expanded_conv_10_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_11_expand_BN (Bat (None, 32, 80, 576)  2304        expanded_conv_11_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_11_expand_relu (L (None, 32, 80, 576)  0           expanded_conv_11_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_11_depthwise (Dep (None, 32, 80, 576)  5184        expanded_conv_11_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_11_depthwise_BN ( (None, 32, 80, 576)  2304        expanded_conv_11_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_11_depthwise_relu (None, 32, 80, 576)  0           expanded_conv_11_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_11_project (Conv2 (None, 32, 80, 96)   55296       expanded_conv_11_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_11_project_BN (Ba (None, 32, 80, 96)   384         expanded_conv_11_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_11_add (Add)      (None, 32, 80, 96)   0           expanded_conv_10_project_BN[0][0]
                                                                 expanded_conv_11_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_12_expand (Conv2D (None, 32, 80, 576)  55296       expanded_conv_11_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_12_expand_BN (Bat (None, 32, 80, 576)  2304        expanded_conv_12_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_12_expand_relu (L (None, 32, 80, 576)  0           expanded_conv_12_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_12_depthwise (Dep (None, 32, 80, 576)  5184        expanded_conv_12_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_12_depthwise_BN ( (None, 32, 80, 576)  2304        expanded_conv_12_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_12_depthwise_relu (None, 32, 80, 576)  0           expanded_conv_12_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_12_project (Conv2 (None, 32, 80, 96)   55296       expanded_conv_12_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_12_project_BN (Ba (None, 32, 80, 96)   384         expanded_conv_12_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_12_add (Add)      (None, 32, 80, 96)   0           expanded_conv_11_add[0][0]       
                                                                 expanded_conv_12_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_13_expand (Conv2D (None, 32, 80, 576)  55296       expanded_conv_12_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_13_expand_BN (Bat (None, 32, 80, 576)  2304        expanded_conv_13_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_13_expand_relu (L (None, 32, 80, 576)  0           expanded_conv_13_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_13_depthwise (Dep (None, 32, 80, 576)  5184        expanded_conv_13_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_13_depthwise_BN ( (None, 32, 80, 576)  2304        expanded_conv_13_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_13_depthwise_relu (None, 32, 80, 576)  0           expanded_conv_13_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_13_project (Conv2 (None, 32, 80, 160)  92160       expanded_conv_13_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_13_project_BN (Ba (None, 32, 80, 160)  640         expanded_conv_13_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_14_expand (Conv2D (None, 32, 80, 960)  153600      expanded_conv_13_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_14_expand_BN (Bat (None, 32, 80, 960)  3840        expanded_conv_14_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_14_expand_relu (L (None, 32, 80, 960)  0           expanded_conv_14_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_14_depthwise (Dep (None, 32, 80, 960)  8640        expanded_conv_14_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_14_depthwise_BN ( (None, 32, 80, 960)  3840        expanded_conv_14_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_14_depthwise_relu (None, 32, 80, 960)  0           expanded_conv_14_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_14_project (Conv2 (None, 32, 80, 160)  153600      expanded_conv_14_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_14_project_BN (Ba (None, 32, 80, 160)  640         expanded_conv_14_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_14_add (Add)      (None, 32, 80, 160)  0           expanded_conv_13_project_BN[0][0]
                                                                 expanded_conv_14_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_15_expand (Conv2D (None, 32, 80, 960)  153600      expanded_conv_14_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_15_expand_BN (Bat (None, 32, 80, 960)  3840        expanded_conv_15_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_15_expand_relu (L (None, 32, 80, 960)  0           expanded_conv_15_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_15_depthwise (Dep (None, 32, 80, 960)  8640        expanded_conv_15_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_15_depthwise_BN ( (None, 32, 80, 960)  3840        expanded_conv_15_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_15_depthwise_relu (None, 32, 80, 960)  0           expanded_conv_15_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_15_project (Conv2 (None, 32, 80, 160)  153600      expanded_conv_15_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_15_project_BN (Ba (None, 32, 80, 160)  640         expanded_conv_15_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_15_add (Add)      (None, 32, 80, 160)  0           expanded_conv_14_add[0][0]       
                                                                 expanded_conv_15_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_16_expand (Conv2D (None, 32, 80, 960)  153600      expanded_conv_15_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_16_expand_BN (Bat (None, 32, 80, 960)  3840        expanded_conv_16_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_16_expand_relu (L (None, 32, 80, 960)  0           expanded_conv_16_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_16_depthwise (Dep (None, 32, 80, 960)  8640        expanded_conv_16_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_16_depthwise_BN ( (None, 32, 80, 960)  3840        expanded_conv_16_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_16_depthwise_relu (None, 32, 80, 960)  0           expanded_conv_16_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_16_project (Conv2 (None, 32, 80, 320)  307200      expanded_conv_16_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_16_project_BN (Ba (None, 32, 80, 320)  1280        expanded_conv_16_project[0][0]   
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 320)    0           expanded_conv_16_project_BN[0][0]
__________________________________________________________________________________________________
image_pooling (Conv2D)          (None, 1, 1, 256)    81920       average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
image_pooling_BN (BatchNormaliz (None, 1, 1, 256)    1024        image_pooling[0][0]              
__________________________________________________________________________________________________
aspp0 (Conv2D)                  (None, 32, 80, 256)  81920       expanded_conv_16_project_BN[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1, 1, 256)    0           image_pooling_BN[0][0]           
__________________________________________________________________________________________________
aspp0_BN (BatchNormalization)   (None, 32, 80, 256)  1024        aspp0[0][0]                      
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 32, 80, 256)  0           activation_1[0][0]               
__________________________________________________________________________________________________
aspp0_activation (Activation)   (None, 32, 80, 256)  0           aspp0_BN[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 80, 512)  0           lambda_3[0][0]                   
                                                                 aspp0_activation[0][0]           
__________________________________________________________________________________________________
concat_projection (Conv2D)      (None, 32, 80, 256)  131072      concatenate_1[0][0]              
__________________________________________________________________________________________________
concat_projection_BN (BatchNorm (None, 32, 80, 256)  1024        concat_projection[0][0]          
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 80, 256)  0           concat_projection_BN[0][0]       
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 80, 256)  0           activation_2[0][0]               
__________________________________________________________________________________________________
subpixel_1 (Subpixel)           (None, 256, 640, 3)  49344       dropout_1[0][0]                  
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 163840, 3)    0           subpixel_1[0][0]                 
__________________________________________________________________________________________________
pred_mask (Activation)          (None, 163840, 3)    0           reshape_2[0][0]                  
==================================================================================================
Total params: 2,190,592
Trainable params: 49,344
Non-trainable params: 2,141,248
__________________________________________________________________________________________________
Optimizer: <keras.optimizers.Adam object at 0x7fe5f9d98908>, learning rate: 0.01, loss: ['categorical_crossentropy'], metrics: ['accuracy']

Callbacks: [<keras.callbacks.ModelCheckpoint object at 0x7fe5fb7cafd0>, <keras.callbacks.ReduceLROnPlateau object at 0x7fe5fb7df1d0>, <keras.callbacks.EarlyStopping object at 0x7fe5fb7cae10>, <keras.callbacks.CSVLogger object at 0x7fe5fb7df710>]

Steps per epoch: 50
Validation steps: 0

Starting training...

Epoch 1/1000
 - 42s - loss: 0.5036 - acc: 0.8097

Epoch 00001: loss improved from inf to 0.50363, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 2/1000
 - 38s - loss: 0.3940 - acc: 0.8451

Epoch 00002: loss improved from 0.50363 to 0.39401, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 3/1000
 - 38s - loss: 0.3842 - acc: 0.8497

Epoch 00003: loss improved from 0.39401 to 0.38425, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 4/1000
 - 38s - loss: 0.3758 - acc: 0.8527

Epoch 00004: loss improved from 0.38425 to 0.37583, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 5/1000
 - 38s - loss: 0.3706 - acc: 0.8552

Epoch 00005: loss improved from 0.37583 to 0.37065, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 6/1000
 - 38s - loss: 0.3668 - acc: 0.8569

Epoch 00006: loss improved from 0.37065 to 0.36675, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 7/1000
 - 38s - loss: 0.3653 - acc: 0.8569

Epoch 00007: loss improved from 0.36675 to 0.36530, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 8/1000
 - 38s - loss: 0.3636 - acc: 0.8590

Epoch 00008: loss improved from 0.36530 to 0.36358, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 9/1000
 - 37s - loss: 0.3611 - acc: 0.8596

Epoch 00009: loss improved from 0.36358 to 0.36110, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 10/1000
 - 37s - loss: 0.3585 - acc: 0.8603

Epoch 00010: loss improved from 0.36110 to 0.35847, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 11/1000
 - 37s - loss: 0.3585 - acc: 0.8612

Epoch 00011: loss did not improve from 0.35847
Epoch 12/1000
 - 37s - loss: 0.3580 - acc: 0.8609

Epoch 00012: loss improved from 0.35847 to 0.35804, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 13/1000
 - 37s - loss: 0.3586 - acc: 0.8604

Epoch 00013: loss did not improve from 0.35804
Epoch 14/1000
 - 35s - loss: 0.3554 - acc: 0.8619

Epoch 00014: loss improved from 0.35804 to 0.35541, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 15/1000
 - 35s - loss: 0.3583 - acc: 0.8609

Epoch 00015: loss did not improve from 0.35541
Epoch 16/1000
 - 35s - loss: 0.3569 - acc: 0.8614

Epoch 00016: loss did not improve from 0.35541
Epoch 17/1000
 - 34s - loss: 0.3572 - acc: 0.8613

Epoch 00017: loss did not improve from 0.35541
Epoch 18/1000
 - 34s - loss: 0.3535 - acc: 0.8625

Epoch 00018: loss improved from 0.35541 to 0.35351, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 19/1000
 - 34s - loss: 0.3567 - acc: 0.8607

Epoch 00019: loss did not improve from 0.35351
Epoch 20/1000
 - 34s - loss: 0.3564 - acc: 0.8616

Epoch 00020: loss did not improve from 0.35351
Epoch 21/1000
 - 34s - loss: 0.3540 - acc: 0.8625

Epoch 00021: loss did not improve from 0.35351
Epoch 22/1000
 - 34s - loss: 0.3554 - acc: 0.8623

Epoch 00022: loss did not improve from 0.35351

Epoch 00022: ReduceLROnPlateau reducing learning rate to 0.004999999888241291.
Epoch 23/1000
 - 34s - loss: 0.3327 - acc: 0.8668

Epoch 00023: loss improved from 0.35351 to 0.33265, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 24/1000
 - 34s - loss: 0.3411 - acc: 0.8645

Epoch 00024: loss did not improve from 0.33265
Epoch 25/1000
 - 34s - loss: 0.3420 - acc: 0.8642

Epoch 00025: loss did not improve from 0.33265
Epoch 26/1000
 - 34s - loss: 0.3422 - acc: 0.8643

Epoch 00026: loss did not improve from 0.33265
Epoch 27/1000
 - 34s - loss: 0.3417 - acc: 0.8646

Epoch 00027: loss did not improve from 0.33265

Epoch 00027: ReduceLROnPlateau reducing learning rate to 0.0024999999441206455.
Epoch 28/1000
 - 34s - loss: 0.3227 - acc: 0.8697

Epoch 00028: loss improved from 0.33265 to 0.32268, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 29/1000
 - 34s - loss: 0.3166 - acc: 0.8706

Epoch 00029: loss improved from 0.32268 to 0.31664, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 30/1000
 - 34s - loss: 0.3140 - acc: 0.8707

Epoch 00030: loss improved from 0.31664 to 0.31403, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 31/1000
 - 34s - loss: 0.3140 - acc: 0.8706

Epoch 00031: loss did not improve from 0.31403
Epoch 32/1000
 - 34s - loss: 0.3148 - acc: 0.8709

Epoch 00032: loss did not improve from 0.31403
Epoch 33/1000
 - 34s - loss: 0.3131 - acc: 0.8710

Epoch 00033: loss improved from 0.31403 to 0.31306, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 34/1000
 - 35s - loss: 0.3129 - acc: 0.8713

Epoch 00034: loss improved from 0.31306 to 0.31286, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 35/1000
 - 34s - loss: 0.3137 - acc: 0.8713

Epoch 00035: loss did not improve from 0.31286
Epoch 36/1000
 - 34s - loss: 0.3126 - acc: 0.8709

Epoch 00036: loss improved from 0.31286 to 0.31261, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 37/1000
 - 34s - loss: 0.3125 - acc: 0.8711

Epoch 00037: loss improved from 0.31261 to 0.31251, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 38/1000
 - 34s - loss: 0.3125 - acc: 0.8714

Epoch 00038: loss did not improve from 0.31251
Epoch 39/1000
 - 34s - loss: 0.3120 - acc: 0.8708

Epoch 00039: loss improved from 0.31251 to 0.31202, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 40/1000
 - 34s - loss: 0.3112 - acc: 0.8718

Epoch 00040: loss improved from 0.31202 to 0.31119, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 41/1000
 - 34s - loss: 0.3115 - acc: 0.8711

Epoch 00041: loss did not improve from 0.31119
Epoch 42/1000
 - 34s - loss: 0.3121 - acc: 0.8718

Epoch 00042: loss did not improve from 0.31119
Epoch 43/1000
 - 34s - loss: 0.3129 - acc: 0.8707

Epoch 00043: loss did not improve from 0.31119
Epoch 44/1000
 - 34s - loss: 0.3121 - acc: 0.8712

Epoch 00044: loss did not improve from 0.31119

Epoch 00044: ReduceLROnPlateau reducing learning rate to 0.0012499999720603228.
Epoch 45/1000
 - 34s - loss: 0.3026 - acc: 0.8736

Epoch 00045: loss improved from 0.31119 to 0.30258, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 46/1000
 - 34s - loss: 0.3016 - acc: 0.8744

Epoch 00046: loss improved from 0.30258 to 0.30165, saving model to weights/innopolis/2019-01-18 11-56-15.hdf5
Epoch 47/1000
 - 34s - loss: 0.3012 - acc: 0.8749
