Date and time: 2019-01-11 13-10-01

Datasets used: ['/home/v.ostankovich/lanes-segmentation/data/images/innopolis']

633
633
Image dtype:uint8
Label dtype:uint8

506
506
127
127
Class weights: [0.16615753 1.         1.43011478]

Model summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 640, 3)  0                                            
__________________________________________________________________________________________________
Conv (Conv2D)                   (None, 128, 320, 32) 864         input_1[0][0]                    
__________________________________________________________________________________________________
Conv_BN (BatchNormalization)    (None, 128, 320, 32) 128         Conv[0][0]                       
__________________________________________________________________________________________________
Conv_Relu6 (Activation)         (None, 128, 320, 32) 0           Conv_BN[0][0]                    
__________________________________________________________________________________________________
expanded_conv_depthwise (Depthw (None, 128, 320, 32) 288         Conv_Relu6[0][0]                 
__________________________________________________________________________________________________
expanded_conv_depthwise_BN (Bat (None, 128, 320, 32) 128         expanded_conv_depthwise[0][0]    
__________________________________________________________________________________________________
expanded_conv_depthwise_relu (A (None, 128, 320, 32) 0           expanded_conv_depthwise_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_project (Conv2D)  (None, 128, 320, 16) 512         expanded_conv_depthwise_relu[0][0
__________________________________________________________________________________________________
expanded_conv_project_BN (Batch (None, 128, 320, 16) 64          expanded_conv_project[0][0]      
__________________________________________________________________________________________________
expanded_conv_1_expand (Conv2D) (None, 128, 320, 96) 1536        expanded_conv_project_BN[0][0]   
__________________________________________________________________________________________________
expanded_conv_1_expand_BN (Batc (None, 128, 320, 96) 384         expanded_conv_1_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_1_expand_relu (Ac (None, 128, 320, 96) 0           expanded_conv_1_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_1_depthwise (Dept (None, 64, 160, 96)  864         expanded_conv_1_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_1_depthwise_BN (B (None, 64, 160, 96)  384         expanded_conv_1_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_1_depthwise_relu  (None, 64, 160, 96)  0           expanded_conv_1_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_1_project (Conv2D (None, 64, 160, 24)  2304        expanded_conv_1_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_1_project_BN (Bat (None, 64, 160, 24)  96          expanded_conv_1_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_2_expand (Conv2D) (None, 64, 160, 144) 3456        expanded_conv_1_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_2_expand_BN (Batc (None, 64, 160, 144) 576         expanded_conv_2_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_2_expand_relu (Ac (None, 64, 160, 144) 0           expanded_conv_2_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_2_depthwise (Dept (None, 64, 160, 144) 1296        expanded_conv_2_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_2_depthwise_BN (B (None, 64, 160, 144) 576         expanded_conv_2_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_2_depthwise_relu  (None, 64, 160, 144) 0           expanded_conv_2_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_2_project (Conv2D (None, 64, 160, 24)  3456        expanded_conv_2_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_2_project_BN (Bat (None, 64, 160, 24)  96          expanded_conv_2_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_2_add (Add)       (None, 64, 160, 24)  0           expanded_conv_1_project_BN[0][0] 
                                                                 expanded_conv_2_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_3_expand (Conv2D) (None, 64, 160, 144) 3456        expanded_conv_2_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_3_expand_BN (Batc (None, 64, 160, 144) 576         expanded_conv_3_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_3_expand_relu (Ac (None, 64, 160, 144) 0           expanded_conv_3_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_3_depthwise (Dept (None, 32, 80, 144)  1296        expanded_conv_3_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_3_depthwise_BN (B (None, 32, 80, 144)  576         expanded_conv_3_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_3_depthwise_relu  (None, 32, 80, 144)  0           expanded_conv_3_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_3_project (Conv2D (None, 32, 80, 32)   4608        expanded_conv_3_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_3_project_BN (Bat (None, 32, 80, 32)   128         expanded_conv_3_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_4_expand (Conv2D) (None, 32, 80, 192)  6144        expanded_conv_3_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_4_expand_BN (Batc (None, 32, 80, 192)  768         expanded_conv_4_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_4_expand_relu (Ac (None, 32, 80, 192)  0           expanded_conv_4_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_4_depthwise (Dept (None, 32, 80, 192)  1728        expanded_conv_4_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_4_depthwise_BN (B (None, 32, 80, 192)  768         expanded_conv_4_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_4_depthwise_relu  (None, 32, 80, 192)  0           expanded_conv_4_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_4_project (Conv2D (None, 32, 80, 32)   6144        expanded_conv_4_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_4_project_BN (Bat (None, 32, 80, 32)   128         expanded_conv_4_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_4_add (Add)       (None, 32, 80, 32)   0           expanded_conv_3_project_BN[0][0] 
                                                                 expanded_conv_4_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_5_expand (Conv2D) (None, 32, 80, 192)  6144        expanded_conv_4_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_5_expand_BN (Batc (None, 32, 80, 192)  768         expanded_conv_5_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_5_expand_relu (Ac (None, 32, 80, 192)  0           expanded_conv_5_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_5_depthwise (Dept (None, 32, 80, 192)  1728        expanded_conv_5_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_5_depthwise_BN (B (None, 32, 80, 192)  768         expanded_conv_5_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_5_depthwise_relu  (None, 32, 80, 192)  0           expanded_conv_5_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_5_project (Conv2D (None, 32, 80, 32)   6144        expanded_conv_5_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_5_project_BN (Bat (None, 32, 80, 32)   128         expanded_conv_5_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_5_add (Add)       (None, 32, 80, 32)   0           expanded_conv_4_add[0][0]        
                                                                 expanded_conv_5_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_6_expand (Conv2D) (None, 32, 80, 192)  6144        expanded_conv_5_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_6_expand_BN (Batc (None, 32, 80, 192)  768         expanded_conv_6_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_6_expand_relu (Ac (None, 32, 80, 192)  0           expanded_conv_6_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_6_depthwise (Dept (None, 32, 80, 192)  1728        expanded_conv_6_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_6_depthwise_BN (B (None, 32, 80, 192)  768         expanded_conv_6_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_6_depthwise_relu  (None, 32, 80, 192)  0           expanded_conv_6_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_6_project (Conv2D (None, 32, 80, 64)   12288       expanded_conv_6_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_6_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_6_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_7_expand (Conv2D) (None, 32, 80, 384)  24576       expanded_conv_6_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_7_expand_BN (Batc (None, 32, 80, 384)  1536        expanded_conv_7_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_7_expand_relu (Ac (None, 32, 80, 384)  0           expanded_conv_7_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_7_depthwise (Dept (None, 32, 80, 384)  3456        expanded_conv_7_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_7_depthwise_BN (B (None, 32, 80, 384)  1536        expanded_conv_7_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_7_depthwise_relu  (None, 32, 80, 384)  0           expanded_conv_7_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_7_project (Conv2D (None, 32, 80, 64)   24576       expanded_conv_7_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_7_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_7_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_7_add (Add)       (None, 32, 80, 64)   0           expanded_conv_6_project_BN[0][0] 
                                                                 expanded_conv_7_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_8_expand (Conv2D) (None, 32, 80, 384)  24576       expanded_conv_7_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_8_expand_BN (Batc (None, 32, 80, 384)  1536        expanded_conv_8_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_8_expand_relu (Ac (None, 32, 80, 384)  0           expanded_conv_8_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_8_depthwise (Dept (None, 32, 80, 384)  3456        expanded_conv_8_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_8_depthwise_BN (B (None, 32, 80, 384)  1536        expanded_conv_8_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_8_depthwise_relu  (None, 32, 80, 384)  0           expanded_conv_8_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_8_project (Conv2D (None, 32, 80, 64)   24576       expanded_conv_8_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_8_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_8_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_8_add (Add)       (None, 32, 80, 64)   0           expanded_conv_7_add[0][0]        
                                                                 expanded_conv_8_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_9_expand (Conv2D) (None, 32, 80, 384)  24576       expanded_conv_8_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_9_expand_BN (Batc (None, 32, 80, 384)  1536        expanded_conv_9_expand[0][0]     
__________________________________________________________________________________________________
expanded_conv_9_expand_relu (Ac (None, 32, 80, 384)  0           expanded_conv_9_expand_BN[0][0]  
__________________________________________________________________________________________________
expanded_conv_9_depthwise (Dept (None, 32, 80, 384)  3456        expanded_conv_9_expand_relu[0][0]
__________________________________________________________________________________________________
expanded_conv_9_depthwise_BN (B (None, 32, 80, 384)  1536        expanded_conv_9_depthwise[0][0]  
__________________________________________________________________________________________________
expanded_conv_9_depthwise_relu  (None, 32, 80, 384)  0           expanded_conv_9_depthwise_BN[0][0
__________________________________________________________________________________________________
expanded_conv_9_project (Conv2D (None, 32, 80, 64)   24576       expanded_conv_9_depthwise_relu[0]
__________________________________________________________________________________________________
expanded_conv_9_project_BN (Bat (None, 32, 80, 64)   256         expanded_conv_9_project[0][0]    
__________________________________________________________________________________________________
expanded_conv_9_add (Add)       (None, 32, 80, 64)   0           expanded_conv_8_add[0][0]        
                                                                 expanded_conv_9_project_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_10_expand (Conv2D (None, 32, 80, 384)  24576       expanded_conv_9_add[0][0]        
__________________________________________________________________________________________________
expanded_conv_10_expand_BN (Bat (None, 32, 80, 384)  1536        expanded_conv_10_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_10_expand_relu (A (None, 32, 80, 384)  0           expanded_conv_10_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_10_depthwise (Dep (None, 32, 80, 384)  3456        expanded_conv_10_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_10_depthwise_BN ( (None, 32, 80, 384)  1536        expanded_conv_10_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_10_depthwise_relu (None, 32, 80, 384)  0           expanded_conv_10_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_10_project (Conv2 (None, 32, 80, 96)   36864       expanded_conv_10_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_10_project_BN (Ba (None, 32, 80, 96)   384         expanded_conv_10_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_11_expand (Conv2D (None, 32, 80, 576)  55296       expanded_conv_10_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_11_expand_BN (Bat (None, 32, 80, 576)  2304        expanded_conv_11_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_11_expand_relu (A (None, 32, 80, 576)  0           expanded_conv_11_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_11_depthwise (Dep (None, 32, 80, 576)  5184        expanded_conv_11_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_11_depthwise_BN ( (None, 32, 80, 576)  2304        expanded_conv_11_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_11_depthwise_relu (None, 32, 80, 576)  0           expanded_conv_11_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_11_project (Conv2 (None, 32, 80, 96)   55296       expanded_conv_11_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_11_project_BN (Ba (None, 32, 80, 96)   384         expanded_conv_11_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_11_add (Add)      (None, 32, 80, 96)   0           expanded_conv_10_project_BN[0][0]
                                                                 expanded_conv_11_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_12_expand (Conv2D (None, 32, 80, 576)  55296       expanded_conv_11_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_12_expand_BN (Bat (None, 32, 80, 576)  2304        expanded_conv_12_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_12_expand_relu (A (None, 32, 80, 576)  0           expanded_conv_12_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_12_depthwise (Dep (None, 32, 80, 576)  5184        expanded_conv_12_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_12_depthwise_BN ( (None, 32, 80, 576)  2304        expanded_conv_12_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_12_depthwise_relu (None, 32, 80, 576)  0           expanded_conv_12_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_12_project (Conv2 (None, 32, 80, 96)   55296       expanded_conv_12_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_12_project_BN (Ba (None, 32, 80, 96)   384         expanded_conv_12_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_12_add (Add)      (None, 32, 80, 96)   0           expanded_conv_11_add[0][0]       
                                                                 expanded_conv_12_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_13_expand (Conv2D (None, 32, 80, 576)  55296       expanded_conv_12_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_13_expand_BN (Bat (None, 32, 80, 576)  2304        expanded_conv_13_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_13_expand_relu (A (None, 32, 80, 576)  0           expanded_conv_13_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_13_depthwise (Dep (None, 32, 80, 576)  5184        expanded_conv_13_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_13_depthwise_BN ( (None, 32, 80, 576)  2304        expanded_conv_13_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_13_depthwise_relu (None, 32, 80, 576)  0           expanded_conv_13_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_13_project (Conv2 (None, 32, 80, 160)  92160       expanded_conv_13_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_13_project_BN (Ba (None, 32, 80, 160)  640         expanded_conv_13_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_14_expand (Conv2D (None, 32, 80, 960)  153600      expanded_conv_13_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_14_expand_BN (Bat (None, 32, 80, 960)  3840        expanded_conv_14_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_14_expand_relu (A (None, 32, 80, 960)  0           expanded_conv_14_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_14_depthwise (Dep (None, 32, 80, 960)  8640        expanded_conv_14_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_14_depthwise_BN ( (None, 32, 80, 960)  3840        expanded_conv_14_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_14_depthwise_relu (None, 32, 80, 960)  0           expanded_conv_14_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_14_project (Conv2 (None, 32, 80, 160)  153600      expanded_conv_14_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_14_project_BN (Ba (None, 32, 80, 160)  640         expanded_conv_14_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_14_add (Add)      (None, 32, 80, 160)  0           expanded_conv_13_project_BN[0][0]
                                                                 expanded_conv_14_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_15_expand (Conv2D (None, 32, 80, 960)  153600      expanded_conv_14_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_15_expand_BN (Bat (None, 32, 80, 960)  3840        expanded_conv_15_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_15_expand_relu (A (None, 32, 80, 960)  0           expanded_conv_15_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_15_depthwise (Dep (None, 32, 80, 960)  8640        expanded_conv_15_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_15_depthwise_BN ( (None, 32, 80, 960)  3840        expanded_conv_15_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_15_depthwise_relu (None, 32, 80, 960)  0           expanded_conv_15_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_15_project (Conv2 (None, 32, 80, 160)  153600      expanded_conv_15_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_15_project_BN (Ba (None, 32, 80, 160)  640         expanded_conv_15_project[0][0]   
__________________________________________________________________________________________________
expanded_conv_15_add (Add)      (None, 32, 80, 160)  0           expanded_conv_14_add[0][0]       
                                                                 expanded_conv_15_project_BN[0][0]
__________________________________________________________________________________________________
expanded_conv_16_expand (Conv2D (None, 32, 80, 960)  153600      expanded_conv_15_add[0][0]       
__________________________________________________________________________________________________
expanded_conv_16_expand_BN (Bat (None, 32, 80, 960)  3840        expanded_conv_16_expand[0][0]    
__________________________________________________________________________________________________
expanded_conv_16_expand_relu (A (None, 32, 80, 960)  0           expanded_conv_16_expand_BN[0][0] 
__________________________________________________________________________________________________
expanded_conv_16_depthwise (Dep (None, 32, 80, 960)  8640        expanded_conv_16_expand_relu[0][0
__________________________________________________________________________________________________
expanded_conv_16_depthwise_BN ( (None, 32, 80, 960)  3840        expanded_conv_16_depthwise[0][0] 
__________________________________________________________________________________________________
expanded_conv_16_depthwise_relu (None, 32, 80, 960)  0           expanded_conv_16_depthwise_BN[0][
__________________________________________________________________________________________________
expanded_conv_16_project (Conv2 (None, 32, 80, 320)  307200      expanded_conv_16_depthwise_relu[0
__________________________________________________________________________________________________
expanded_conv_16_project_BN (Ba (None, 32, 80, 320)  1280        expanded_conv_16_project[0][0]   
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 320)    0           expanded_conv_16_project_BN[0][0]
__________________________________________________________________________________________________
image_pooling (Conv2D)          (None, 1, 1, 256)    81920       average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
image_pooling_BN (BatchNormaliz (None, 1, 1, 256)    1024        image_pooling[0][0]              
__________________________________________________________________________________________________
aspp0 (Conv2D)                  (None, 32, 80, 256)  81920       expanded_conv_16_project_BN[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1, 1, 256)    0           image_pooling_BN[0][0]           
__________________________________________________________________________________________________
aspp0_BN (BatchNormalization)   (None, 32, 80, 256)  1024        aspp0[0][0]                      
__________________________________________________________________________________________________
bilinear_upsampling_1 (Bilinear (None, 32, 80, 256)  0           activation_1[0][0]               
__________________________________________________________________________________________________
aspp0_activation (Activation)   (None, 32, 80, 256)  0           aspp0_BN[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 80, 512)  0           bilinear_upsampling_1[0][0]      
                                                                 aspp0_activation[0][0]           
__________________________________________________________________________________________________
concat_projection (Conv2D)      (None, 32, 80, 256)  131072      concatenate_1[0][0]              
__________________________________________________________________________________________________
concat_projection_BN (BatchNorm (None, 32, 80, 256)  1024        concat_projection[0][0]          
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 80, 256)  0           concat_projection_BN[0][0]       
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 80, 256)  0           activation_2[0][0]               
__________________________________________________________________________________________________
custom_logits_semantic (Conv2D) (None, 32, 80, 3)    771         dropout_1[0][0]                  
__________________________________________________________________________________________________
bilinear_upsampling_2 (Bilinear (None, 256, 640, 3)  0           custom_logits_semantic[0][0]     
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 640, 3)  0           bilinear_upsampling_2[0][0]      
==================================================================================================
Total params: 2,142,019
Trainable params: 2,108,931
Non-trainable params: 33,088
__________________________________________________________________________________________________
Optimizer: <keras.optimizers.Adam object at 0x7f073dd1ce90>, learning rate: 0.0001, loss: categorical_crossentropy, metrics: ['accuracy']

Callbacks: [<keras.callbacks.ModelCheckpoint object at 0x7f07c7da8550>, <keras.callbacks.ReduceLROnPlateau object at 0x7f073cbcb290>, <keras.callbacks.EarlyStopping object at 0x7f073cc18d90>, <keras.callbacks.CSVLogger object at 0x7f073dd0d6d0>]

Steps per epoch: 506
Validation steps: 127

Starting training...

Epoch 1/1000
 - 69s - loss: 0.3024 - acc: 0.8834 - val_loss: 0.3021 - val_acc: 0.8890

Epoch 00001: val_loss improved from inf to 0.30212, saving model to weights/innopolis/2019-01-11 13-10-01.hdf5
Epoch 2/1000
 - 57s - loss: 0.1934 - acc: 0.9253 - val_loss: 0.3522 - val_acc: 0.8799

Epoch 00002: val_loss did not improve from 0.30212
Epoch 3/1000
 - 57s - loss: 0.1577 - acc: 0.9390 - val_loss: 0.3880 - val_acc: 0.8742

Epoch 00003: val_loss did not improve from 0.30212
Epoch 4/1000
 - 58s - loss: 0.1296 - acc: 0.9506 - val_loss: 0.4332 - val_acc: 0.8737

Epoch 00004: val_loss did not improve from 0.30212
Epoch 5/1000
 - 57s - loss: 0.1051 - acc: 0.9601 - val_loss: 0.3050 - val_acc: 0.9045

Epoch 00005: val_loss did not improve from 0.30212
Epoch 6/1000
 - 57s - loss: 0.0880 - acc: 0.9667 - val_loss: 0.2772 - val_acc: 0.9127

Epoch 00006: val_loss improved from 0.30212 to 0.27723, saving model to weights/innopolis/2019-01-11 13-10-01.hdf5
Epoch 7/1000
 - 56s - loss: 0.0735 - acc: 0.9722 - val_loss: 0.3054 - val_acc: 0.9098

Epoch 00007: val_loss did not improve from 0.27723
Epoch 8/1000
 - 54s - loss: 0.0611 - acc: 0.9768 - val_loss: 0.3249 - val_acc: 0.9129

Epoch 00008: val_loss did not improve from 0.27723
Epoch 9/1000
 - 57s - loss: 0.0572 - acc: 0.9782 - val_loss: 0.3827 - val_acc: 0.9006

Epoch 00009: val_loss did not improve from 0.27723
Epoch 10/1000
 - 58s - loss: 0.0544 - acc: 0.9791 - val_loss: 0.2991 - val_acc: 0.9204

Epoch 00010: val_loss did not improve from 0.27723
Epoch 11/1000
 - 54s - loss: 0.0525 - acc: 0.9799 - val_loss: 0.3417 - val_acc: 0.9070

Epoch 00011: val_loss did not improve from 0.27723
Epoch 12/1000
 - 59s - loss: 0.0449 - acc: 0.9826 - val_loss: 0.3246 - val_acc: 0.9181

Epoch 00012: val_loss did not improve from 0.27723
Epoch 13/1000
 - 57s - loss: 0.0438 - acc: 0.9831 - val_loss: 0.3931 - val_acc: 0.9091

Epoch 00013: val_loss did not improve from 0.27723
Epoch 14/1000
 - 55s - loss: 0.0412 - acc: 0.9839 - val_loss: 0.3377 - val_acc: 0.9181

Epoch 00014: val_loss did not improve from 0.27723
Epoch 15/1000
 - 53s - loss: 0.0387 - acc: 0.9849 - val_loss: 0.4031 - val_acc: 0.9062

Epoch 00015: val_loss did not improve from 0.27723
Epoch 16/1000
 - 55s - loss: 0.0390 - acc: 0.9848 - val_loss: 0.5535 - val_acc: 0.8814

Epoch 00016: val_loss did not improve from 0.27723
Epoch 17/1000
 - 55s - loss: 0.0387 - acc: 0.9848 - val_loss: 0.3637 - val_acc: 0.9097

Epoch 00017: val_loss did not improve from 0.27723

Epoch 00017: ReduceLROnPlateau reducing learning rate to 4.99999987369e-05.
Epoch 18/1000
 - 55s - loss: 0.0336 - acc: 0.9867 - val_loss: 0.3342 - val_acc: 0.9160

Epoch 00018: val_loss did not improve from 0.27723
Epoch 19/1000
 - 56s - loss: 0.0260 - acc: 0.9897 - val_loss: 0.2860 - val_acc: 0.9305

Epoch 00019: val_loss did not improve from 0.27723
Epoch 20/1000
 - 55s - loss: 0.0247 - acc: 0.9902 - val_loss: 0.3531 - val_acc: 0.9221

Epoch 00020: val_loss did not improve from 0.27723
Epoch 21/1000
 - 56s - loss: 0.0236 - acc: 0.9906 - val_loss: 0.3269 - val_acc: 0.9242

Epoch 00021: val_loss did not improve from 0.27723
Epoch 22/1000
 - 56s - loss: 0.0225 - acc: 0.9910 - val_loss: 0.3658 - val_acc: 0.9219

Epoch 00022: val_loss did not improve from 0.27723
Epoch 23/1000
 - 54s - loss: 0.0223 - acc: 0.9911 - val_loss: 0.4535 - val_acc: 0.9122

Epoch 00023: val_loss did not improve from 0.27723
Epoch 24/1000
 - 55s - loss: 0.0226 - acc: 0.9910 - val_loss: 0.4404 - val_acc: 0.9128

Epoch 00024: val_loss did not improve from 0.27723
Epoch 25/1000
 - 56s - loss: 0.0228 - acc: 0.9909 - val_loss: 0.3375 - val_acc: 0.9249

Epoch 00025: val_loss did not improve from 0.27723

Epoch 00025: ReduceLROnPlateau reducing learning rate to 2.49999993684e-05.
Epoch 26/1000
 - 56s - loss: 0.0230 - acc: 0.9907 - val_loss: 0.3262 - val_acc: 0.9273

Epoch 00026: val_loss did not improve from 0.27723
Epoch 00026: early stopping
Finished training

Date and time: 2019-01-11 13-35-10

